y3s2/cs4231/cs4231.org
#+TITLE: Cs4231

* Arrows
- $a\prec b$ is process order.
- $a\to b$ is happen-before order: the logical clock value is less than, iff
  there is a directed path. Clearly $a\prec b\implies a\to b$.
- $a\leadsto b$ is the send-receive order.
* Lecture 5 Global Snapshot
Assumption: channels are FIFO. If not, it is discussed in Message Ordering
lecture
** Definitions
*** Global snapshot
A set of events =E= such that for any event =e= in =E=, if $f\prec e$, then
$f\in E$.
*** Consistent global snapshot
A global snapshot where if $e_1$ send, $e_2$ receive, $e_2$ in then $e_1$ must be in.
** Chandy & Lamport's protocal for taking snapshots
- Key idea:
  1. after a process takes a snapshot, it orders others to stop via a message
  2. If they already took a snapshot before the order arrives, then capture all
     message till the order (these are the on-the-fly messages)
  3. Otherwise once they receive the order, stop. (otherwise will receive stuff
     which sender does not include)
* Lecture 6 Message Ordering
We still assume FIFO (except for fully async order) for inter-process channels.
** Definitions
*** Fully Asynchronous
No restriction.
*** FIFO
Messages $s_1,s_2$ are sent from i to j. Then $\neg(s_2\prec s_1)$.
*** Causally Ordered
If $s_1$ happen before $s_2$, $r_1, r_2$ on the same process, then $r_1\prec
r_2$.
*** Synchronous Ordered
Diagram can be redrawn into vertical, respecting happen-before, process and
send-receive order.
** Algorithm to ensure Causal Ordering
*** Core Idea
When a process sends a message, attach also every message you have seen or sent
so far.
*** Why does it work?
- Recall causal ordering: if s1 happens before s2 (there is a directed path),
  then r1 must before r2
- If s1 and s2 are on the same process, then attaching all messages it has sent
  will include s1 for the target process to see before s2
- If not on the same process, then attaching all messages it has received will
  include s1 for the target process to see before s2.
*** Can we improve it?
- Just include messages that are targeted at the receiving process.
- Or number each message locally on the process. Instead of attaching all
  messages, make the target wait until all processes' intended message to it has
  been delivered.
