y3s2/cs4231/cs4231.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-30 Fri 16:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cs4231</title>
<meta name="author" content="Tan Yee Jian" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Cs4231</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org29e4cc8">1. Arrows</a></li>
<li><a href="#org287a316">2. Lecture 5 Global Snapshot</a>
<ul>
<li><a href="#org946204f">2.1. Definitions</a>
<ul>
<li><a href="#orgf0703e1">2.1.1. Global snapshot</a></li>
<li><a href="#org50716ba">2.1.2. Consistent global snapshot</a></li>
</ul>
</li>
<li><a href="#org02bd957">2.2. Chandy &amp; Lamport&rsquo;s protocal for taking snapshots</a></li>
</ul>
</li>
<li><a href="#org0ffa8f5">3. Lecture 6 Message Ordering</a>
<ul>
<li><a href="#orgaa7206a">3.1. Definitions</a>
<ul>
<li><a href="#orgac00a7e">3.1.1. Fully Asynchronous</a></li>
<li><a href="#orgcb52953">3.1.2. FIFO</a></li>
<li><a href="#orgdb3469b">3.1.3. Causally Ordered</a></li>
<li><a href="#org2554385">3.1.4. Synchronous Ordered</a></li>
</ul>
</li>
<li><a href="#org51221f4">3.2. Algorithm to ensure Causal Ordering</a>
<ul>
<li><a href="#org8ac2f23">3.2.1. Core Idea</a></li>
<li><a href="#org8b00946">3.2.2. Why does it work?</a></li>
<li><a href="#org105f711">3.2.3. Can we improve it?</a></li>
</ul>
</li>
<li><a href="#org9542e01">3.3. Skeen&rsquo;s Algorithm for Broadcast Ordering</a>
<ul>
<li><a href="#org4487841">3.3.1. Core Idea</a></li>
<li><a href="#org7d2dc57">3.3.2. Summary</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org35ba0b5">4. Lecture 7 Leader Election</a>
<ul>
<li><a href="#orgf083f47">4.1. Chang-Roberts Algorithm for Leader Election</a>
<ul>
<li><a href="#org09f5d52">4.1.1. Setting</a></li>
<li><a href="#orgdce9ecc">4.1.2. Algorithm</a></li>
<li><a href="#org029a15b">4.1.3. Complexity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2e472f">5. Lecture 8 Consensus</a>
<ul>
<li><a href="#org6cd73b2">5.1. Timing Models</a>
<ul>
<li><a href="#orga21b6f8">5.1.1. Synchronous</a></li>
</ul>
</li>
<li><a href="#orgfac1d1a">5.2. Goals/Conditions for consensus</a>
<ul>
<li><a href="#orgacebe19">5.2.1. Termination</a></li>
<li><a href="#org2bf53f8">5.2.2. Agreement</a></li>
<li><a href="#orga244bb4">5.2.3. Validity</a></li>
</ul>
</li>
<li><a href="#org0b08225">5.3. Version 0: No failure (regardless of timing model)</a>
<ul>
<li><a href="#org660bdac">5.3.1. Algorithm</a></li>
<li><a href="#org9bb6d8a">5.3.2. When does it work?</a></li>
</ul>
</li>
<li><a href="#orge1cda8c">5.4. Version 1: (Synchronous) Node crash failures</a>
<ul>
<li><a href="#org3d11d8a">5.4.1. Setup</a></li>
<li><a href="#org0c78d2c">5.4.2. Intuition</a></li>
<li><a href="#org4385f5f">5.4.3. Protocol</a></li>
<li><a href="#org5b538c1">5.4.4. Lower bound is (Omega(f))</a></li>
</ul>
</li>
<li><a href="#org771dbef">5.5. Version 2: (Synchronous) Link Failure</a>
<ul>
<li><a href="#orgfac85e3">5.5.1. Setup</a></li>
<li><a href="#org0cbbcc8">5.5.2. Goal 1: Termination, Agreement, Validity</a></li>
<li><a href="#org1b03367">5.5.3. Goal 2: T, A, Weakened Validity</a></li>
<li><a href="#orgee1d6c7">5.5.4. Goal 3: T, Limited Agreement, Weakened Validity</a></li>
</ul>
</li>
<li><a href="#org367046e">5.6. Version 3: (Asynchronous) Node crash failures</a>
<ul>
<li><a href="#orgbc04526">5.6.1. Setup</a></li>
<li><a href="#org9becade">5.6.2. Fischer-Lynch-Paterson (FLP) Impossibility Theorem</a></li>
</ul>
</li>
<li><a href="#org40785d1">5.7. Version 4: (Synchronous) Byzantine Failures</a>
<ul>
<li><a href="#orgebda40e">5.7.1. Failure Model</a></li>
<li><a href="#org4c3775c">5.7.2. Modified goals - everything only applies to non-faulty nodes</a></li>
<li><a href="#orgea28da3">5.7.3. A simple (unsuccessful) attempt</a></li>
<li><a href="#org8d3a11e">5.7.4. Theorem: Byzantine Consensus Threshold</a></li>
<li><a href="#orgadd4419">5.7.5. A protocol for # nodes n &gt;= 4f+1</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org29e4cc8" class="outline-2">
<h2 id="org29e4cc8"><span class="section-number-2">1</span> Arrows</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>\(a\prec b\) is process order.</li>
<li>\(a\to b\) is happen-before order: the logical clock value is less than, iff
there is a directed path. Clearly \(a\prec b\implies a\to b\).</li>
<li>\(a\leadsto b\) is the send-receive order.</li>
</ul>
</div>
</div>
<div id="outline-container-org287a316" class="outline-2">
<h2 id="org287a316"><span class="section-number-2">2</span> Lecture 5 Global Snapshot</h2>
<div class="outline-text-2" id="text-2">
<p>
Assumption: channels are FIFO. If not, it is discussed in Message Ordering
lecture
</p>
</div>
<div id="outline-container-org946204f" class="outline-3">
<h3 id="org946204f"><span class="section-number-3">2.1</span> Definitions</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf0703e1" class="outline-4">
<h4 id="orgf0703e1"><span class="section-number-4">2.1.1</span> Global snapshot</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
A set of events <code>E</code> such that for any event <code>e</code> in <code>E</code>, if \(f\prec e\), then
\(f\in E\).
</p>
</div>
</div>
<div id="outline-container-org50716ba" class="outline-4">
<h4 id="org50716ba"><span class="section-number-4">2.1.2</span> Consistent global snapshot</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
A global snapshot where if \(e_1\) send, \(e_2\) receive, \(e_2\) in then \(e_1\) must be in.
</p>
</div>
</div>
</div>
<div id="outline-container-org02bd957" class="outline-3">
<h3 id="org02bd957"><span class="section-number-3">2.2</span> Chandy &amp; Lamport&rsquo;s protocal for taking snapshots</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Key idea:
<ol class="org-ol">
<li>after a process takes a snapshot, it orders others to stop via a message</li>
<li>If they already took a snapshot before the order arrives, then capture all
message till the order (these are the on-the-fly messages)</li>
<li>Otherwise once they receive the order, stop. (otherwise will receive stuff
which sender does not include)</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0ffa8f5" class="outline-2">
<h2 id="org0ffa8f5"><span class="section-number-2">3</span> Lecture 6 Message Ordering</h2>
<div class="outline-text-2" id="text-3">
<p>
We still assume FIFO (except for fully async order) for inter-process channels.
</p>
</div>
<div id="outline-container-orgaa7206a" class="outline-3">
<h3 id="orgaa7206a"><span class="section-number-3">3.1</span> Definitions</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgac00a7e" class="outline-4">
<h4 id="orgac00a7e"><span class="section-number-4">3.1.1</span> Fully Asynchronous</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
No restriction.
</p>
</div>
</div>
<div id="outline-container-orgcb52953" class="outline-4">
<h4 id="orgcb52953"><span class="section-number-4">3.1.2</span> FIFO</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Messages \(s_1,s_2\) are sent from i to j. Then \(\neg(s_2\prec s_1)\).
</p>
</div>
</div>
<div id="outline-container-orgdb3469b" class="outline-4">
<h4 id="orgdb3469b"><span class="section-number-4">3.1.3</span> Causally Ordered</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
If \(s_1\) happen before \(s_2\), \(r_1, r_2\) on the same process, then \(r_1\prec
r_2\).
</p>
</div>
</div>
<div id="outline-container-org2554385" class="outline-4">
<h4 id="org2554385"><span class="section-number-4">3.1.4</span> Synchronous Ordered</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Diagram can be redrawn into vertical, respecting happen-before, process and
send-receive order.
</p>
</div>
</div>
</div>
<div id="outline-container-org51221f4" class="outline-3">
<h3 id="org51221f4"><span class="section-number-3">3.2</span> Algorithm to ensure Causal Ordering</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org8ac2f23" class="outline-4">
<h4 id="org8ac2f23"><span class="section-number-4">3.2.1</span> Core Idea</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
When a process sends a message, attach also every message you have seen or sent
so far.
</p>
</div>
</div>
<div id="outline-container-org8b00946" class="outline-4">
<h4 id="org8b00946"><span class="section-number-4">3.2.2</span> Why does it work?</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>Recall causal ordering: if s1 happens before s2 (there is a directed path),
then r1 must before r2</li>
<li>If s1 and s2 are on the same process, then attaching all messages it has sent
will include s1 for the target process to see before s2</li>
<li>If not on the same process, then attaching all messages it has received will
include s1 for the target process to see before s2.</li>
</ul>
</div>
</div>
<div id="outline-container-org105f711" class="outline-4">
<h4 id="org105f711"><span class="section-number-4">3.2.3</span> Can we improve it?</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>Just include messages that are targeted at the receiving process.</li>
<li>Or number each message locally on the process. Instead of attaching all
messages, make the target wait until all processes&rsquo; intended message to it has
been delivered.</li>
</ul>
</div>
</div>
</div>
