y3s2/cs4231/cs4231.tex
% Created 2021-04-30 Fri 16:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsthm}
\usepackage{minted}
\author{Tan Yee Jian}
\date{\today}
\title{Cs4231}
\hypersetup{
  pdfauthor={Tan Yee Jian},
  pdftitle={Cs4231},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 27.2 (Org mode 9.4.4)},
  pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Arrows}
\label{sec:org1881088}
\begin{itemize}
  \item \(a\prec b\) is process order.
  \item \(a\to b\) is happen-before order: the logical clock value is less than, iff
        there is a directed path. Clearly \(a\prec b\implies a\to b\).
  \item \(a\leadsto b\) is the send-receive order.
\end{itemize}
\section{Lecture 5 Global Snapshot}
\label{sec:orgeba08ca}
Assumption: channels are FIFO. If not, it is discussed in Message Ordering
lecture
\subsection{Definitions}
\label{sec:orgcdef94f}
\subsubsection{Global snapshot}
\label{sec:orgb685326}
A set of events \texttt{E} such that for any event \texttt{e} in \texttt{E}, if \(f\prec e\), then
\(f\in E\).
\subsubsection{Consistent global snapshot}
\label{sec:orgea00abd}
A global snapshot where if \(e_1\) send, \(e_2\) receive, \(e_2\) in then \(e_1\) must be in.
\subsection{Chandy \& Lamport's protocal for taking snapshots}
\label{sec:orgf0defc2}
\begin{itemize}
  \item Key idea:
        \begin{enumerate}
          \item after a process takes a snapshot, it orders others to stop via a message
          \item If they already took a snapshot before the order arrives, then capture all
                message till the order (these are the on-the-fly messages)
          \item Otherwise once they receive the order, stop. (otherwise will receive stuff
                which sender does not include)
        \end{enumerate}
\end{itemize}
\section{Lecture 6 Message Ordering}
\label{sec:org8d1d9f7}
We still assume FIFO (except for fully async order) for inter-process channels.
\subsection{Definitions}
\label{sec:org7ce1ebf}
\subsubsection{Fully Asynchronous}
\label{sec:org1ca21bd}
No restriction.
\subsubsection{FIFO}
\label{sec:org0baa245}
Messages \(s_1,s_2\) are sent from i to j. Then \(\neg(s_2\prec s_1)\).
\subsubsection{Causally Ordered}
\label{sec:org20a9c79}
If \(s_1\) happen before \(s_2\), \(r_1, r_2\) on the same process, then \(r_1\prec
r_2\).
\subsubsection{Synchronous Ordered}
\label{sec:org87de76a}
Diagram can be redrawn into vertical, respecting happen-before, process and
send-receive order.
\subsection{Algorithm to ensure Causal Ordering}
\label{sec:orgf896f74}
\subsubsection{Core Idea}
\label{sec:org8ed3d63}
When a process sends a message, attach also every message you have seen or sent
so far.
\subsubsection{Why does it work?}
\label{sec:org0453d7c}
\begin{itemize}
  \item Recall causal ordering: if s1 happens before s2 (there is a directed path),
        then r1 must before r2
  \item If s1 and s2 are on the same process, then attaching all messages it has sent
        will include s1 for the target process to see before s2
  \item If not on the same process, then attaching all messages it has received will
        include s1 for the target process to see before s2.
\end{itemize}
\subsubsection{Can we improve it?}
\label{sec:org7ccdaa7}
\begin{itemize}
  \item Just include messages that are targeted at the receiving process.
  \item Or number each message locally on the process. Instead of attaching all
        messages, make the target wait until all processes' intended message to it has
        been delivered.
\end{itemize}
