y3s2/cs4231/cs4231.org
** Skeen's Algorithm for Broadcast Ordering
- An example is a chat group, sending messages to everyone
- Everyone needs the same message number for the same msg
*** Core Idea
1. First round - send message to everyone to save in the buffer. After saving,
   each process replies the coordinator their current logical clock number.
2. Wait for all them to come back, and assign the message the largest logical
   clock number.
3. Let everyone know the decided message number.
*** Summary
It orders messages, not logical clock numbers. Each logical clock value run as
usual.
* Lecture 7 Leader Election
** Chang-Roberts Algorithm for Leader Election
*** Setting
Given a ring of nodes that can only send messages clockwise, select a leader
*** Algorithm
1. Sending: Every node send its number clockwise
2. Receiving: Every node relay the message (clockwise) if the value is bigger
   than self.
3. If receive own id, then it is the leader
*** Complexity
**** Message Complexity
Number of messages sent
**** Best Case
Condition: sorted in clockwise ascending
1+...+1+n = 2n-1
**** Worst case
Condition: sorted in clockwise descending
1 + 2 + ... + n = n(n+1)/2
**** Average case?
* Lecture 8 Consensus
** Timing Models
*** Synchronous
- Bounded amount of time to do processing (generate output msg, process input
  msg)
- and bounded amount of time to send messages
** Goals/Conditions for consensus
*** Termination
*** Agreement
*** Validity
** Version 0: No failure (regardless of timing model)
*** Algorithm
For any process:
1. Keep broadcasting own value
2. Once confident have all messages (due to known ub), run a deterministic
   algorithm on all values (eg. max/min)
*** When does it work?
**** TODO Synchronous
**** TODO Async
** Version 1: (Synchronous) Node crash failures
*** Setup
- Synchronous, all nodes have bounded processing time, all message has bounded
  delay
- Crash failure - crashes forever. On a "round" that it crashes, broadcast might
  not happen/not be complete.
*** Intuition
- We use rounds to gain information on crash: if no reply, then crashed.
- How to delineate rounds: let t1 be delay to generate output, t2 for message
  propagation, t3 to process input, then each round is simply =t1+t2+t3= long.
**** Suppose we don't have accurate clock
- Claim: every clock should be some constant multiple of other clocks.
- Consider a case where clock = 2x accurate clock.
  + Attempt 1: everyone set round duration to =2(t1+t2+t3)=. The process with
    faster clock will advance rounds faster. Then every process that receives a
    new message starts a new round. But what if a round starts before a process
    has time to process its received message?
  + Attempt 2: We provide the offset, making the round duration
    =2(t1+t2+t3+(t1+t2))=, the new offset tolerates the message delay(process
    output, send msg) to the "latest" node.
*** Protocol
