y3s2/cs4231/cs4231.html
<div id="outline-container-org9542e01" class="outline-3">
<h3 id="org9542e01"><span class="section-number-3">3.3</span> Skeen&rsquo;s Algorithm for Broadcast Ordering</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>An example is a chat group, sending messages to everyone</li>
<li>Everyone needs the same message number for the same msg</li>
</ul>
</div>
<div id="outline-container-org4487841" class="outline-4">
<h4 id="org4487841"><span class="section-number-4">3.3.1</span> Core Idea</h4>
<div class="outline-text-4" id="text-3-3-1">
<ol class="org-ol">
<li>First round - send message to everyone to save in the buffer. After saving,
each process replies the coordinator their current logical clock number.</li>
<li>Wait for all them to come back, and assign the message the largest logical
clock number.</li>
<li>Let everyone know the decided message number.</li>
</ol>
</div>
</div>
<div id="outline-container-org7d2dc57" class="outline-4">
<h4 id="org7d2dc57"><span class="section-number-4">3.3.2</span> Summary</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
It orders messages, not logical clock numbers. Each logical clock value run as
usual.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org35ba0b5" class="outline-2">
<h2 id="org35ba0b5"><span class="section-number-2">4</span> Lecture 7 Leader Election</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf083f47" class="outline-3">
<h3 id="orgf083f47"><span class="section-number-3">4.1</span> Chang-Roberts Algorithm for Leader Election</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org09f5d52" class="outline-4">
<h4 id="org09f5d52"><span class="section-number-4">4.1.1</span> Setting</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Given a ring of nodes that can only send messages clockwise, select a leader
</p>
</div>
</div>
<div id="outline-container-orgdce9ecc" class="outline-4">
<h4 id="orgdce9ecc"><span class="section-number-4">4.1.2</span> Algorithm</h4>
<div class="outline-text-4" id="text-4-1-2">
<ol class="org-ol">
<li>Sending: Every node send its number clockwise</li>
<li>Receiving: Every node relay the message (clockwise) if the value is bigger
than self.</li>
<li>If receive own id, then it is the leader</li>
</ol>
</div>
</div>
<div id="outline-container-org029a15b" class="outline-4">
<h4 id="org029a15b"><span class="section-number-4">4.1.3</span> Complexity</h4>
<div class="outline-text-4" id="text-4-1-3">
</div>
<ol class="org-ol">
<li><a id="org73caf87"></a>Message Complexity<br />
<div class="outline-text-5" id="text-4-1-3-1">
<p>
Number of messages sent
</p>
</div>
</li>
<li><a id="org13b9d35"></a>Best Case<br />
<div class="outline-text-5" id="text-4-1-3-2">
<p>
Condition: sorted in clockwise ascending
1+&#x2026;+1+n = 2n-1
</p>
</div>
</li>
<li><a id="org820b8bc"></a>Worst case<br />
<div class="outline-text-5" id="text-4-1-3-3">
<p>
Condition: sorted in clockwise descending
1 + 2 + &#x2026; + n = n(n+1)/2
</p>
</div>
</li>
<li><a id="org3a59af7"></a>Average case?<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb2e472f" class="outline-2">
<h2 id="orgb2e472f"><span class="section-number-2">5</span> Lecture 8 Consensus</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6cd73b2" class="outline-3">
<h3 id="org6cd73b2"><span class="section-number-3">5.1</span> Timing Models</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orga21b6f8" class="outline-4">
<h4 id="orga21b6f8"><span class="section-number-4">5.1.1</span> Synchronous</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>Bounded amount of time to do processing (generate output msg, process input
msg)</li>
<li>and bounded amount of time to send messages</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfac1d1a" class="outline-3">
<h3 id="orgfac1d1a"><span class="section-number-3">5.2</span> Goals/Conditions for consensus</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgacebe19" class="outline-4">
<h4 id="orgacebe19"><span class="section-number-4">5.2.1</span> Termination</h4>
</div>
<div id="outline-container-org2bf53f8" class="outline-4">
<h4 id="org2bf53f8"><span class="section-number-4">5.2.2</span> Agreement</h4>
</div>
<div id="outline-container-orga244bb4" class="outline-4">
<h4 id="orga244bb4"><span class="section-number-4">5.2.3</span> Validity</h4>
</div>
</div>
<div id="outline-container-org0b08225" class="outline-3">
<h3 id="org0b08225"><span class="section-number-3">5.3</span> Version 0: No failure (regardless of timing model)</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org660bdac" class="outline-4">
<h4 id="org660bdac"><span class="section-number-4">5.3.1</span> Algorithm</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
For any process:
</p>
<ol class="org-ol">
<li>Keep broadcasting own value</li>
<li>Once confident have all messages (due to known ub), run a deterministic
algorithm on all values (eg. max/min)</li>
</ol>
</div>
</div>
<div id="outline-container-org9bb6d8a" class="outline-4">
<h4 id="org9bb6d8a"><span class="section-number-4">5.3.2</span> When does it work?</h4>
<div class="outline-text-4" id="text-5-3-2">
</div>
<ol class="org-ol">
<li><a id="orgb0fecde"></a><span class="todo TODO">TODO</span> Synchronous<br /></li>
<li><a id="org31532bc"></a><span class="todo TODO">TODO</span> Async<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orge1cda8c" class="outline-3">
<h3 id="orge1cda8c"><span class="section-number-3">5.4</span> Version 1: (Synchronous) Node crash failures</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org3d11d8a" class="outline-4">
<h4 id="org3d11d8a"><span class="section-number-4">5.4.1</span> Setup</h4>
<div class="outline-text-4" id="text-5-4-1">
<ul class="org-ul">
<li>Synchronous, all nodes have bounded processing time, all message has bounded
delay</li>
<li>Crash failure - crashes forever. On a &ldquo;round&rdquo; that it crashes, broadcast might
not happen/not be complete.</li>
</ul>
</div>
</div>
<div id="outline-container-org0c78d2c" class="outline-4">
<h4 id="org0c78d2c"><span class="section-number-4">5.4.2</span> Intuition</h4>
<div class="outline-text-4" id="text-5-4-2">
<ul class="org-ul">
<li>We use rounds to gain information on crash: if no reply, then crashed.</li>
<li>How to delineate rounds: let t1 be delay to generate output, t2 for message
propagation, t3 to process input, then each round is simply <code>t1+t2+t3</code> long.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org90f0c12"></a>Suppose we don&rsquo;t have accurate clock<br />
<div class="outline-text-5" id="text-5-4-2-1">
<ul class="org-ul">
<li>Claim: every clock should be some constant multiple of other clocks.</li>
<li>Consider a case where clock = 2x accurate clock.
<ul class="org-ul">
<li>Attempt 1: everyone set round duration to <code>2(t1+t2+t3)</code>. The process with
faster clock will advance rounds faster. Then every process that receives a
new message starts a new round. But what if a round starts before a process
has time to process its received message?</li>
<li>Attempt 2: We provide the offset, making the round duration
<code>2(t1+t2+t3+(t1+t2))</code>, the new offset tolerates the message delay(process
output, send msg) to the &ldquo;latest&rdquo; node.</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
