y3s2/cs4231/cs4231.tex
\subsection{Skeen's Algorithm for Broadcast Ordering}
\label{sec:orge4e7905}
\begin{itemize}
  \item An example is a chat group, sending messages to everyone
  \item Everyone needs the same message number for the same msg
\end{itemize}
\subsubsection{Core Idea}
\label{sec:org11c5dae}
\begin{enumerate}
  \item First round - send message to everyone to save in the buffer. After saving,
        each process replies the coordinator their current logical clock number.
  \item Wait for all them to come back, and assign the message the largest logical
        clock number.
  \item Let everyone know the decided message number.
\end{enumerate}
\subsubsection{Summary}
\label{sec:orgab337c5}
It orders messages, not logical clock numbers. Each logical clock value run as
usual.
\section{Lecture 7 Leader Election}
\label{sec:org808ec1e}
\subsection{Chang-Roberts Algorithm for Leader Election}
\label{sec:org0b3baae}
\subsubsection{Setting}
\label{sec:org7567e1b}
Given a ring of nodes that can only send messages clockwise, select a leader
\subsubsection{Algorithm}
\label{sec:org80a8bb4}
\begin{enumerate}
  \item Sending: Every node send its number clockwise
  \item Receiving: Every node relay the message (clockwise) if the value is bigger
        than self.
  \item If receive own id, then it is the leader
\end{enumerate}
\subsubsection{Complexity}
\label{sec:org86f55de}
\begin{enumerate}
  \item Message Complexity
        \label{sec:org2e23e03}
        Number of messages sent
  \item Best Case
        \label{sec:org4232628}
        Condition: sorted in clockwise ascending
        1+\ldots{}+1+n = 2n-1
  \item Worst case
        \label{sec:orgcfafe84}
        Condition: sorted in clockwise descending
        1 + 2 + \ldots{} + n = n(n+1)/2
  \item Average case?
        \label{sec:orgaeec55c}
\end{enumerate}
\section{Lecture 8 Consensus}
\label{sec:org9287394}
\subsection{Timing Models}
\label{sec:org9be41b7}
\subsubsection{Synchronous}
\label{sec:org7fd73e7}
\begin{itemize}
  \item Bounded amount of time to do processing (generate output msg, process input
        msg)
  \item and bounded amount of time to send messages
\end{itemize}
\subsection{Goals/Conditions for consensus}
\label{sec:org14e5ae4}
\subsubsection{Termination}
\label{sec:org288ea4c}
\subsubsection{Agreement}
\label{sec:org1574847}
\subsubsection{Validity}
\label{sec:org0e32ccf}
\subsection{Version 0: No failure (regardless of timing model)}
\label{sec:org1e318af}
\subsubsection{Algorithm}
\label{sec:orgb907115}
For any process:
\begin{enumerate}
  \item Keep broadcasting own value
  \item Once confident have all messages (due to known ub), run a deterministic
        algorithm on all values (eg. max/min)
\end{enumerate}
\subsubsection{When does it work?}
\label{sec:org9d9ccb8}
\begin{enumerate}
  \item {\bfseries\sffamily TODO} Synchronous
        \label{sec:orgccd72eb}
  \item {\bfseries\sffamily TODO} Async
        \label{sec:orgbe157ed}
\end{enumerate}
\subsection{Version 1: (Synchronous) Node crash failures}
\label{sec:org67b2133}
\subsubsection{Setup}
\label{sec:org0f51323}
\begin{itemize}
  \item Synchronous, all nodes have bounded processing time, all message has bounded
        delay
  \item Crash failure - crashes forever. On a ``round'' that it crashes, broadcast might
        not happen/not be complete.
\end{itemize}
\subsubsection{Intuition}
\label{sec:org3ff8c98}
\begin{itemize}
  \item We use rounds to gain information on crash: if no reply, then crashed.
  \item How to delineate rounds: let t1 be delay to generate output, t2 for message
        propagation, t3 to process input, then each round is simply \texttt{t1+t2+t3} long.
\end{itemize}
\begin{enumerate}
  \item Suppose we don't have accurate clock
        \label{sec:org9620598}
        \begin{itemize}
          \item Claim: every clock should be some constant multiple of other clocks.
          \item Consider a case where clock = 2x accurate clock.
                \begin{itemize}
                  \item Attempt 1: everyone set round duration to \texttt{2(t1+t2+t3)}. The process with
                        faster clock will advance rounds faster. Then every process that receives a
                        new message starts a new round. But what if a round starts before a process
                        has time to process its received message?
                  \item Attempt 2: We provide the offset, making the round duration
                        \texttt{2(t1+t2+t3+(t1+t2))}, the new offset tolerates the message delay(process
                        output, send msg) to the ``latest'' node.
                \end{itemize}
        \end{itemize}
\end{enumerate}
