y3s2/cs4231/cs4231.org
**** Intuition
- suppose there is no failure, we can just broadcast our message to everyone and conclude.
- Since there can be a failure, we can *"forward"* all messages received in our broadcast.
- What is left is to decide how many rounds are needed.
**** Details
1. Intialize the set =S:={my_input}=.
2. Broadcast S to everyone for =f+1= rounds (where f is number of node crashes
   to tolerate)
3. Union S with all the sets received in this round, and repeat 2.
**** Correctness
***** Termination is obvious (f+1 rounds, bounded waiting)
***** Validity is obvious (if everyone same input, S = {s} is singleton)
***** Agreement
1. Given f+1 rounds and f failure, there must be at least 1 round with no
   failure. Call that the good round.
2. See that the good round must end with all nodes (that haven't crashed) with
   the same set =S=.
3. After the good round, each nodes's =S= do not change anymore.
4. Then the deterministic function will choose the same value for all surviving
   nodes.
*** Lower bound is (Omega(f))
 - Statement: any deterministic algorithm that works (fulfills termination,
   agreement, validity) must take at least f+1 rounds.
 - Proof is too hard (not in scope).
** Version 2: (Synchronous) Link Failure
*** Setup
- nodes do not fail
- but the message channels (between any pair of processes) can fail arbitrarily
  long (drop unbounded # of messages)
*** Goal 1: Termination, Agreement, Validity
- Termination: all nodes eventually decide
- Agreement: all nodes settle on one same value
- Validity: if all started as same value, must settle on that value.
**** There is no deterministic algorithm
1. Suppose there is one. Two processes with a eternally failing channel. Assume
   both have input 1, then has to conclude with 1.
   | process | input | conclusion |
   |---------+-------+------------|
   | A       |     1 |          1 |
   | B       |     1 |          1 |
2. Suppose process B has input 0. To A, this is indistinguishable from B having
   input 1 since they cannot communicate. Thus B will still conclude 1.
   | process | input | conclusion            |
   |---------+-------+-----------------------|
   | A       |     1 | 1 (indistinguishable) |
   | B       |     0 | 1                     |
3. By Agreement, B will conclude as 1 too, force by A's ignorant conclusion.
   | process | input | conclusion    |
   |---------+-------+---------------|
   | A       |     1 | 1             |
   | B       |     0 | 1 (Agreement) |
4. Now suppose A has input 0 as well. To B, this is indistinguishable from A
   having 1 (remember by 2, 3, A having 1 forces B to conclude 1) so it will
   still conclude with 1.
   | process | input | conclusion            |
   |---------+-------+-----------------------|
   | A       |     0 | 1                     |
   | B       |     0 | 1 (indistinguishable) |
5. Then A will be forced to conclude with 1, violating Validity. Contradiction.
   | process | input | conclusion   |
   |---------+-------+--------------|
   | A       |     0 | 1 (validity) |
   | B       |     0 | 1            |
