y3s2/cs4231/cs4231.html
<div id="outline-container-org4385f5f" class="outline-4">
<h4 id="org4385f5f"><span class="section-number-4">5.4.3</span> Protocol</h4>
<div class="outline-text-4" id="text-5-4-3">
</div>
<ol class="org-ol">
<li><a id="orgb2e214e"></a>Intuition<br />
<div class="outline-text-5" id="text-5-4-3-1">
<ul class="org-ul">
<li>suppose there is no failure, we can just broadcast our message to everyone and conclude.</li>
<li>Since there can be a failure, we can <b>&ldquo;forward&rdquo;</b> all messages received in our broadcast.</li>
<li>What is left is to decide how many rounds are needed.</li>
</ul>
</div>
</li>
<li><a id="org0c53949"></a>Details<br />
<div class="outline-text-5" id="text-5-4-3-2">
<ol class="org-ol">
<li>Intialize the set <code>S:={my_input}</code>.</li>
<li>Broadcast S to everyone for <code>f+1</code> rounds (where f is number of node crashes
to tolerate)</li>
<li>Union S with all the sets received in this round, and repeat 2.</li>
</ol>
</div>
</li>
<li><a id="orgedf88d6"></a>Correctness<br />
<ol class="org-ol">
<li><a id="orgceae3b4"></a>Termination is obvious (f+1 rounds, bounded waiting)<br /></li>
<li><a id="org042daaa"></a>Validity is obvious (if everyone same input, S = {s} is singleton)<br /></li>
<li><a id="org12d1a2c"></a>Agreement<br />
<div class="outline-text-6" id="text-5-4-3-3-3">
<ol class="org-ol">
<li>Given f+1 rounds and f failure, there must be at least 1 round with no
failure. Call that the good round.</li>
<li>See that the good round must end with all nodes (that haven&rsquo;t crashed) with
the same set <code>S</code>.</li>
<li>After the good round, each nodes&rsquo;s <code>S</code> do not change anymore.</li>
<li>Then the deterministic function will choose the same value for all surviving
nodes.</li>
</ol>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org5b538c1" class="outline-4">
<h4 id="org5b538c1"><span class="section-number-4">5.4.4</span> Lower bound is (Omega(f))</h4>
<div class="outline-text-4" id="text-5-4-4">
<ul class="org-ul">
<li>Statement: any deterministic algorithm that works (fulfills termination,
agreement, validity) must take at least f+1 rounds.</li>
<li>Proof is too hard (not in scope).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org771dbef" class="outline-3">
<h3 id="org771dbef"><span class="section-number-3">5.5</span> Version 2: (Synchronous) Link Failure</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-orgfac85e3" class="outline-4">
<h4 id="orgfac85e3"><span class="section-number-4">5.5.1</span> Setup</h4>
<div class="outline-text-4" id="text-5-5-1">
<ul class="org-ul">
<li>nodes do not fail</li>
<li>but the message channels (between any pair of processes) can fail arbitrarily
long (drop unbounded # of messages)</li>
</ul>
</div>
</div>
<div id="outline-container-org0cbbcc8" class="outline-4">
<h4 id="org0cbbcc8"><span class="section-number-4">5.5.2</span> Goal 1: Termination, Agreement, Validity</h4>
<div class="outline-text-4" id="text-5-5-2">
<ul class="org-ul">
<li>Termination: all nodes eventually decide</li>
<li>Agreement: all nodes settle on one same value</li>
<li>Validity: if all started as same value, must settle on that value.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org7d5a6f3"></a>There is no deterministic algorithm<br />
<div class="outline-text-5" id="text-5-5-2-1">
<ol class="org-ol">
<li><p>
Suppose there is one. Two processes with a eternally failing channel. Assume
both have input 1, then has to conclude with 1.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-right">conclusion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table></li>
<li><p>
Suppose process B has input 0. To A, this is indistinguishable from B having
input 1 since they cannot communicate. Thus B will still conclude 1.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-left">conclusion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">1</td>
<td class="org-left">1 (indistinguishable)</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">0</td>
<td class="org-left">1</td>
</tr>
</tbody>
</table></li>
<li><p>
By Agreement, B will conclude as 1 too, force by A&rsquo;s ignorant conclusion.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-left">conclusion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">1</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">0</td>
<td class="org-left">1 (Agreement)</td>
</tr>
</tbody>
</table></li>
<li><p>
Now suppose A has input 0 as well. To B, this is indistinguishable from A
having 1 (remember by 2, 3, A having 1 forces B to conclude 1) so it will
still conclude with 1.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-left">conclusion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">0</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">0</td>
<td class="org-left">1 (indistinguishable)</td>
</tr>
</tbody>
</table></li>
<li><p>
Then A will be forced to conclude with 1, violating Validity. Contradiction.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-left">conclusion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-right">0</td>
<td class="org-left">1 (validity)</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-right">0</td>
<td class="org-left">1</td>
</tr>
</tbody>
</table></li>
</ol>
</div>
</li>
</ol>
</div>
