y3s2/cs4231/cs4231.tex
\subsubsection{Protocol}
\label{sec:orgeebc586}
\begin{enumerate}
  \item Intuition
        \label{sec:org8c4a5d5}
        \begin{itemize}
          \item suppose there is no failure, we can just broadcast our message to everyone and conclude.
          \item Since there can be a failure, we can \textbf{``forward''} all messages received in our broadcast.
          \item What is left is to decide how many rounds are needed.
        \end{itemize}
  \item Details
        \label{sec:org84abdb8}
        \begin{enumerate}
          \item Intialize the set \texttt{S:=\{my\_input\}}.
          \item Broadcast S to everyone for \texttt{f+1} rounds (where f is number of node crashes
                to tolerate)
          \item Union S with all the sets received in this round, and repeat 2.
        \end{enumerate}
  \item Correctness
        \label{sec:org3f8a457}
        \begin{enumerate}
          \item Termination is obvious (f+1 rounds, bounded waiting)
                \label{sec:orgc0c8b1c}
          \item Validity is obvious (if everyone same input, S = \{s\} is singleton)
                \label{sec:org2012c0f}
          \item Agreement
                \label{sec:orge6e4d16}
                \begin{enumerate}
                  \item Given f+1 rounds and f failure, there must be at least 1 round with no
                        failure. Call that the good round.
                  \item See that the good round must end with all nodes (that haven't crashed) with
                        the same set \texttt{S}.
                  \item After the good round, each nodes's \texttt{S} do not change anymore.
                  \item Then the deterministic function will choose the same value for all surviving
                        nodes.
                \end{enumerate}
        \end{enumerate}
\end{enumerate}
\subsubsection{Lower bound is (Omega(f))}
\label{sec:org779cd2c}
\begin{itemize}
  \item Statement: any deterministic algorithm that works (fulfills termination,
        agreement, validity) must take at least f+1 rounds.
  \item Proof is too hard (not in scope).
\end{itemize}
\subsection{Version 2: (Synchronous) Link Failure}
\label{sec:orgff2c823}
\subsubsection{Setup}
\label{sec:orgf83acf7}
\begin{itemize}
  \item nodes do not fail
  \item but the message channels (between any pair of processes) can fail arbitrarily
        long (drop unbounded \# of messages)
\end{itemize}
\subsubsection{Goal 1: Termination, Agreement, Validity}
\label{sec:org74df533}
\begin{itemize}
  \item Termination: all nodes eventually decide
  \item Agreement: all nodes settle on one same value
  \item Validity: if all started as same value, must settle on that value.
\end{itemize}
\begin{enumerate}
  \item There is no deterministic algorithm
        \label{sec:org4ae2aad}
        \begin{enumerate}
          \item Suppose there is one. Two processes with a eternally failing channel. Assume
                both have input 1, then has to conclude with 1.
                \begin{center}
                  \begin{tabular}{lrr}
                    process & input & conclusion\\
                    \hline
                    A & 1 & 1\\
                    B & 1 & 1\\
                  \end{tabular}
                \end{center}
          \item Suppose process B has input 0. To A, this is indistinguishable from B having
                input 1 since they cannot communicate. Thus B will still conclude 1.
                \begin{center}
                  \begin{tabular}{lrl}
                    process & input & conclusion\\
                    \hline
                    A & 1 & 1 (indistinguishable)\\
                    B & 0 & 1\\
                  \end{tabular}
                \end{center}
          \item By Agreement, B will conclude as 1 too, force by A's ignorant conclusion.
                \begin{center}
                  \begin{tabular}{lrl}
                    process & input & conclusion\\
                    \hline
                    A & 1 & 1\\
                    B & 0 & 1 (Agreement)\\
                  \end{tabular}
                \end{center}
          \item Now suppose A has input 0 as well. To B, this is indistinguishable from A
                having 1 (remember by 2, 3, A having 1 forces B to conclude 1) so it will
                still conclude with 1.
                \begin{center}
                  \begin{tabular}{lrl}
                    process & input & conclusion\\
                    \hline
                    A & 0 & 1\\
                    B & 0 & 1 (indistinguishable)\\
                  \end{tabular}
                \end{center}
          \item Then A will be forced to conclude with 1, violating Validity. Contradiction.
                \begin{center}
                  \begin{tabular}{lrl}
                    process & input & conclusion\\
                    \hline
                    A & 0 & 1 (validity)\\
                    B & 0 & 1\\
                  \end{tabular}
                \end{center}
        \end{enumerate}
\end{enumerate}
