y3s2/cs4231/cs4231.org
*** Goal 2: T, A, Weakened Validity
- Since validity was violated just now, we try to weaken it. Is consensus
  possible now?
- If all start from 0, should settle on 0
- If all start from 1, then must settle on 1 only if no message is lost
**** Still no deterministic algorithm.
- Lemma: if two processes start with 1, and one process's last message is lost,
  none detects it. Then the one who lost, B, didn't know it lost, hence is
  *indistinguishable* from nothing is lost and must settle on 1. By agreement, A
  should settle on 1 as well.
- Using the lemma above, we can still chain indistinguishability from 0, 0 to 1,
  1 and force a contradiction (settle on 0, 0 given 1, 1, when all messages are
  lost)
***** Proof of no deterministic algorithm
Essentially the same as in the previous Goal, but start with 0,0. Achieve
contradiction not by validity (we weakened it thus would not be contradicted),
but consider an undetected loss of last message, which has to conclude with 1,1.
*** Goal 3: T, Limited Agreement, Weakened Validity
- Limited Agreement: all nodes decide on the same value with probability =
  (1-$\epsilon$)
**** The concept of adversary
We imagine the message losses are not just random, but as bad as possible, as if
designed by an adversary to destroy our plans for consensus. Then we do a worst
case analysis against this adversary.
**** Randomized Algorithm that works with error (1/r)
1. Setup: We have processes P1, P2, etc.
   - All random choices not known by adversary beforehand.
   - Let the total number of rounds to be =r=.
   - Each process has an *input*, 0 or 1. Each process has a value called
     *level*, initialized to 0.
   - P1 sets the a *bar* randomly between 1 and r, inclusive. Every process
     tries to increment *level* so that they reach the *bar* over the =r=
     rounds.
2. Broadcast messages and receive messages for r rounds. Each message contain
   *bar* (if you know it), *input*, and own *level*. Upon receive, update own
   *level* to =l+1= if everyone is at least level =l=.
3. We can inductively show that every pair of levels must differ by at most one
   at every round.
4. Once r rounds are over, decide on 1 IFF you know that everyone has input 1
   AND you know bar (trivial for P1) AND level >= bar.
***** Analysis
****** Termination (obvious by =r= rounds)
****** Agreement with probability (1-1/r)
- Since not every process's *level* will reach *bar*, not everyone can decide
correctly (eg, should decide 1 but limited by insufficient level). We then
analyze what is the probability for these events.
- Error only happens if P1 decide on 1 while P2 decide on 0 (WLOG).
- Denote P1's level as L1, P2's level as L2.
******* Scenario: One process decides 1, the other process decides 0
