y3s2/cs4231/cs4231.html
<div id="outline-container-org1b03367" class="outline-4">
<h4 id="org1b03367"><span class="section-number-4">5.5.3</span> Goal 2: T, A, Weakened Validity</h4>
<div class="outline-text-4" id="text-5-5-3">
<ul class="org-ul">
<li>Since validity was violated just now, we try to weaken it. Is consensus
possible now?</li>
<li>If all start from 0, should settle on 0</li>
<li>If all start from 1, then must settle on 1 only if no message is lost</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org25753ac"></a>Still no deterministic algorithm.<br />
<div class="outline-text-5" id="text-5-5-3-1">
<ul class="org-ul">
<li>Lemma: if two processes start with 1, and one process&rsquo;s last message is lost,
none detects it. Then the one who lost, B, didn&rsquo;t know it lost, hence is
<b>indistinguishable</b> from nothing is lost and must settle on 1. By agreement, A
should settle on 1 as well.</li>
<li>Using the lemma above, we can still chain indistinguishability from 0, 0 to 1,
1 and force a contradiction (settle on 0, 0 given 1, 1, when all messages are
lost)</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgef76a21"></a>Proof of no deterministic algorithm<br />
<div class="outline-text-6" id="text-5-5-3-1-1">
<p>
Essentially the same as in the previous Goal, but start with 0,0. Achieve
contradiction not by validity (we weakened it thus would not be contradicted),
but consider an undetected loss of last message, which has to conclude with 1,1.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgee1d6c7" class="outline-4">
<h4 id="orgee1d6c7"><span class="section-number-4">5.5.4</span> Goal 3: T, Limited Agreement, Weakened Validity</h4>
<div class="outline-text-4" id="text-5-5-4">
<ul class="org-ul">
<li>Limited Agreement: all nodes decide on the same value with probability =
(1-\(\epsilon\))</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org5354d88"></a>The concept of adversary<br />
<div class="outline-text-5" id="text-5-5-4-1">
<p>
We imagine the message losses are not just random, but as bad as possible, as if
designed by an adversary to destroy our plans for consensus. Then we do a worst
case analysis against this adversary.
</p>
</div>
</li>
<li><a id="org708cbac"></a>Randomized Algorithm that works with error (1/r)<br />
<div class="outline-text-5" id="text-5-5-4-2">
<ol class="org-ol">
<li>Setup: We have processes P1, P2, etc.
<ul class="org-ul">
<li>All random choices not known by adversary beforehand.</li>
<li>Let the total number of rounds to be <code>r</code>.</li>
<li>Each process has an <b>input</b>, 0 or 1. Each process has a value called
<b>level</b>, initialized to 0.</li>
<li>P1 sets the a <b>bar</b> randomly between 1 and r, inclusive. Every process
tries to increment <b>level</b> so that they reach the <b>bar</b> over the <code>r</code>
rounds.</li>
</ul></li>
<li>Broadcast messages and receive messages for r rounds. Each message contain
<b>bar</b> (if you know it), <b>input</b>, and own <b>level</b>. Upon receive, update own
<b>level</b> to <code>l+1</code> if everyone is at least level <code>l</code>.</li>
<li>We can inductively show that every pair of levels must differ by at most one
at every round.</li>
<li>Once r rounds are over, decide on 1 IFF you know that everyone has input 1
AND you know bar (trivial for P1) AND level &gt;= bar.</li>
</ol>
</div>
<ol class="org-ol">
<li><a id="org69e62a7"></a>Analysis<br />
<ol class="org-ol">
<li><a id="orgf258ae0"></a>Termination (obvious by <code>r</code> rounds)<br /></li>
<li><a id="orgc489ad5"></a>Agreement with probability (1-1/r)<br />
<div class="outline-text-7" id="text-5-5-4-2-1-2">
<ul class="org-ul">
<li>Since not every process&rsquo;s <b>level</b> will reach <b>bar</b>, not everyone can decide</li>
</ul>
<p>
correctly (eg, should decide 1 but limited by insufficient level). We then
analyze what is the probability for these events.
</p>
<ul class="org-ul">
<li>Error only happens if P1 decide on 1 while P2 decide on 0 (WLOG).</li>
<li>Denote P1&rsquo;s level as L1, P2&rsquo;s level as L2.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org88ab826"></a>Scenario: One process decides 1, the other process decides 0<br />
<ol class="org-ol">
