y3s2/cs4231/cs4231.tex
\subsubsection{Goal 2: T, A, Weakened Validity}
\label{sec:orgf15b4ba}
\begin{itemize}
  \item Since validity was violated just now, we try to weaken it. Is consensus
        possible now?
  \item If all start from 0, should settle on 0
  \item If all start from 1, then must settle on 1 only if no message is lost
\end{itemize}
\begin{enumerate}
  \item Still no deterministic algorithm.
        \label{sec:orgc435ea8}
        \begin{itemize}
          \item Lemma: if two processes start with 1, and one process's last message is lost,
                none detects it. Then the one who lost, B, didn't know it lost, hence is
                \textbf{indistinguishable} from nothing is lost and must settle on 1. By agreement, A
                should settle on 1 as well.
          \item Using the lemma above, we can still chain indistinguishability from 0, 0 to 1,
                1 and force a contradiction (settle on 0, 0 given 1, 1, when all messages are
                lost)
        \end{itemize}
        \begin{enumerate}
          \item Proof of no deterministic algorithm
                \label{sec:org4fc6e07}
                Essentially the same as in the previous Goal, but start with 0,0. Achieve
                contradiction not by validity (we weakened it thus would not be contradicted),
                but consider an undetected loss of last message, which has to conclude with 1,1.
        \end{enumerate}
\end{enumerate}
\subsubsection{Goal 3: T, Limited Agreement, Weakened Validity}
\label{sec:org3463446}
\begin{itemize}
  \item Limited Agreement: all nodes decide on the same value with probability =
        (1-\(\epsilon\))
\end{itemize}
\begin{enumerate}
  \item The concept of adversary
        \label{sec:orgcd0d58d}
        We imagine the message losses are not just random, but as bad as possible, as if
        designed by an adversary to destroy our plans for consensus. Then we do a worst
        case analysis against this adversary.
  \item Randomized Algorithm that works with error (1/r)
        \label{sec:org9350328}
        \begin{enumerate}
          \item Setup: We have processes P1, P2, etc.
                \begin{itemize}
                  \item All random choices not known by adversary beforehand.
                  \item Let the total number of rounds to be \texttt{r}.
                  \item Each process has an \textbf{input}, 0 or 1. Each process has a value called
                        \textbf{level}, initialized to 0.
                  \item P1 sets the a \textbf{bar} randomly between 1 and r, inclusive. Every process
                        tries to increment \textbf{level} so that they reach the \textbf{bar} over the \texttt{r}
                        rounds.
                \end{itemize}
          \item Broadcast messages and receive messages for r rounds. Each message contain
                \textbf{bar} (if you know it), \textbf{input}, and own \textbf{level}. Upon receive, update own
                \textbf{level} to \texttt{l+1} if everyone is at least level \texttt{l}.
          \item We can inductively show that every pair of levels must differ by at most one
                at every round.
          \item Once r rounds are over, decide on 1 IFF you know that everyone has input 1
                AND you know bar (trivial for P1) AND level >= bar.
        \end{enumerate}
        \begin{enumerate}
          \item Analysis
                \label{sec:org4d2258e}
                \begin{enumerate}
                  \item Termination (obvious by \texttt{r} rounds)
                        \label{sec:org9880bd7}
                  \item Agreement with probability (1-1/r)
                        \label{sec:orgab96424}
                        \begin{itemize}
                          \item Since not every process's \textbf{level} will reach \textbf{bar}, not everyone can decide
                        \end{itemize}
                        correctly (eg, should decide 1 but limited by insufficient level). We then
                        analyze what is the probability for these events.
                        \begin{itemize}
                          \item Error only happens if P1 decide on 1 while P2 decide on 0 (WLOG).
                          \item Denote P1's level as L1, P2's level as L2.
                        \end{itemize}
                        \begin{enumerate}
                          \item Scenario: One process decides 1, the other process decides 0
                                \label{sec:orgd225902}
                                \begin{enumerate}
