y3s2/cs4231/cs4231.org
******** Case 1: P1 hears P2, but P2 never heard from P1 at all
- Then P2 must have level 0 (L2 = 0). It never heard from P1 and does not know
  bar, hence will conclude 0.
  | process | level | decision |
  |---------+-------+----------|
  | P1      |       |          |
  | P2      |     0 |        0 |
- P1 hears P2 so must have level 1 (L1 = 1). To be an error case, it must
  decide 1.
  | process | level | decision |
  |---------+-------+----------|
  | P1      |     1 |        1 |
  | P2      |     0 |        0 |
- What do we know, now P1 decides 1? All conditions below must be fulfilled:
  1. Knows bar (no new info, P1 set the bar)
  2. All inputs are 1
  3. 1 >= bar. Since bar is at least 1, bar = 1.
********* Conclusion: only happens when bar = 1, probability = 1/r
******** Case 2: P2 hears P1, but P1 never heard from P2 at all
- Then P1 must have level 0 (L1 = 0). It never heard from P2 and does not know
  P2's input, hence will conclude 0.
  | process | level | decision |
  |---------+-------+----------|
  | P1      |     0 |        0 |
  | P2      |       |          |
- P2 hears P1 so must have level 1 (L2 = 1). To be an error case, it must
  decide 1.
  | process | level | decision |
  |---------+-------+----------|
  | P1      |     0 |        0 |
  | P2      |     1 |        1 |
- What do we know, now P2 decides 1? All conditions below must be fulfilled:
  1. Knows bar (no new info, P2 heard from P1)
  2. All inputs are 1
  3. 1 = L2 >= bar. Since bar is at least 1, bar = 1.
********* Conclusion: only happens when bar = 1, probability = 1/r
******** Case 3: P1 did not hear from P2 and vice versa
This case would not cause error, since they will both conclude 0.
******** Case 4: P1 heard from P2 and vice versa
- The only violatable condition before concluding 1, is that =level<bar=.
- Their *level* difference is at most one (by lemma).
- Probability is =1/r=, when the *bar* is set to the maximum of the two.
******* Conclusion: error probability is 1/r.
****** Weakened Validity
- suppose everyone starts with 0, no one can conclude 1 therefore everyone will
  conclude 0.
- suppose everyone starts with 1.
  + suppose no message lost, everyone will reach *bar* in =r= ($r\ge bar$)
    rounds. In fact, everyone will have *level* = =r=. Everyone will conclude 1.
  + suppose message lost, then can decide on anything.
**** Error probability of 1/#rounds is a lower bound.
- proof can be found in Lynch.
** Version 3: (Asynchronous) Node crash failures
