y3s2/cs4231/cs4231.html
<li><a id="org5f81b88"></a>Case 1: P1 hears P2, but P2 never heard from P1 at all<br />
<div class="outline-text-9" id="text-5-5-4-2-1-2-1-1">
<ul class="org-ul">
<li><p>
Then P2 must have level 0 (L2 = 0). It never heard from P1 and does not know
bar, hence will conclude 0.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-left">level</th>
<th scope="col" class="org-left">decision</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P2</td>
<td class="org-left">0</td>
<td class="org-left">0</td>
</tr>
</tbody>
</table></li>
<li><p>
P1 hears P2 so must have level 1 (L1 = 1). To be an error case, it must
decide 1.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">level</th>
<th scope="col" class="org-right">decision</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">P2</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table></li>
<li>What do we know, now P1 decides 1? All conditions below must be fulfilled:
<ol class="org-ol">
<li>Knows bar (no new info, P1 set the bar)</li>
<li>All inputs are 1</li>
<li>1 &gt;= bar. Since bar is at least 1, bar = 1.</li>
</ol></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org5c68d16"></a>Conclusion: only happens when bar = 1, probability = 1/r<br /></li>
</ol>
</li>
<li><a id="orga4ebb31"></a>Case 2: P2 hears P1, but P1 never heard from P2 at all<br />
<div class="outline-text-9" id="text-5-5-4-2-1-2-1-2">
<ul class="org-ul">
<li><p>
Then P1 must have level 0 (L1 = 0). It never heard from P2 and does not know
P2&rsquo;s input, hence will conclude 0.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">level</th>
<th scope="col" class="org-right">decision</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">P2</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table></li>
<li><p>
P2 hears P1 so must have level 1 (L2 = 1). To be an error case, it must
decide 1.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">process</th>
<th scope="col" class="org-right">level</th>
<th scope="col" class="org-right">decision</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">P2</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table></li>
<li>What do we know, now P2 decides 1? All conditions below must be fulfilled:
<ol class="org-ol">
<li>Knows bar (no new info, P2 heard from P1)</li>
<li>All inputs are 1</li>
<li>1 = L2 &gt;= bar. Since bar is at least 1, bar = 1.</li>
</ol></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgcf2db62"></a>Conclusion: only happens when bar = 1, probability = 1/r<br /></li>
</ol>
</li>
<li><a id="orgddb9e25"></a>Case 3: P1 did not hear from P2 and vice versa<br />
<div class="outline-text-9" id="text-5-5-4-2-1-2-1-3">
<p>
This case would not cause error, since they will both conclude 0.
</p>
</div>
</li>
<li><a id="org3734d40"></a>Case 4: P1 heard from P2 and vice versa<br />
<div class="outline-text-9" id="text-5-5-4-2-1-2-1-4">
<ul class="org-ul">
<li>The only violatable condition before concluding 1, is that <code>level&lt;bar</code>.</li>
<li>Their <b>level</b> difference is at most one (by lemma).</li>
<li>Probability is <code>1/r</code>, when the <b>bar</b> is set to the maximum of the two.</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org5877861"></a>Conclusion: error probability is 1/r.<br /></li>
</ol>
</li>
<li><a id="orgecf5daa"></a>Weakened Validity<br />
<div class="outline-text-7" id="text-5-5-4-2-1-3">
<ul class="org-ul">
<li>suppose everyone starts with 0, no one can conclude 1 therefore everyone will
conclude 0.</li>
<li>suppose everyone starts with 1.
<ul class="org-ul">
<li>suppose no message lost, everyone will reach <b>bar</b> in <code>r</code> (\(r\ge bar\))
rounds. In fact, everyone will have <b>level</b> = <code>r</code>. Everyone will conclude 1.</li>
<li>suppose message lost, then can decide on anything.</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org56fe72f"></a>Error probability of 1/#rounds is a lower bound.<br />
<div class="outline-text-5" id="text-5-5-4-3">
<ul class="org-ul">
<li>proof can be found in Lynch.</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org367046e" class="outline-3">
<h3 id="org367046e"><span class="section-number-3">5.6</span> Version 3: (Asynchronous) Node crash failures</h3>
<div class="outline-text-3" id="text-5-6">
</div>
