y3s2/cs4231/cs4231.tex
                                  \item Case 1: P1 hears P2, but P2 never heard from P1 at all
                                        \label{sec:org5ad3aea}
                                        \begin{itemize}
                                          \item Then P2 must have level 0 (L2 = 0). It never heard from P1 and does not know
                                                bar, hence will conclude 0.
                                                \begin{center}
                                                  \begin{tabular}{lll}
                                                    process & level & decision\\
                                                    \hline
                                                    P1 &  & \\
                                                    P2 & 0 & 0\\
                                                  \end{tabular}
                                                \end{center}
                                          \item P1 hears P2 so must have level 1 (L1 = 1). To be an error case, it must
                                                decide 1.
                                                \begin{center}
                                                  \begin{tabular}{lrr}
                                                    process & level & decision\\
                                                    \hline
                                                    P1 & 1 & 1\\
                                                    P2 & 0 & 0\\
                                                  \end{tabular}
                                                \end{center}
                                          \item What do we know, now P1 decides 1? All conditions below must be fulfilled:
                                                \begin{enumerate}
                                                  \item Knows bar (no new info, P1 set the bar)
                                                  \item All inputs are 1
                                                  \item 1 >= bar. Since bar is at least 1, bar = 1.
                                                \end{enumerate}
                                        \end{itemize}
                                        \begin{enumerate}
                                          \item Conclusion: only happens when bar = 1, probability = 1/r
                                                \label{sec:orgd30a0df}
                                        \end{enumerate}
                                  \item Case 2: P2 hears P1, but P1 never heard from P2 at all
                                        \label{sec:org2a37117}
                                        \begin{itemize}
                                          \item Then P1 must have level 0 (L1 = 0). It never heard from P2 and does not know
                                                P2's input, hence will conclude 0.
                                                \begin{center}
                                                  \begin{tabular}{lrr}
                                                    process & level & decision\\
                                                    \hline
                                                    P1 & 0 & 0\\
                                                    P2 &  & \\
                                                  \end{tabular}
                                                \end{center}
                                          \item P2 hears P1 so must have level 1 (L2 = 1). To be an error case, it must
                                                decide 1.
                                                \begin{center}
                                                  \begin{tabular}{lrr}
                                                    process & level & decision\\
                                                    \hline
                                                    P1 & 0 & 0\\
                                                    P2 & 1 & 1\\
                                                  \end{tabular}
                                                \end{center}
                                          \item What do we know, now P2 decides 1? All conditions below must be fulfilled:
                                                \begin{enumerate}
                                                  \item Knows bar (no new info, P2 heard from P1)
                                                  \item All inputs are 1
                                                  \item 1 = L2 >= bar. Since bar is at least 1, bar = 1.
                                                \end{enumerate}
                                        \end{itemize}
                                        \begin{enumerate}
                                          \item Conclusion: only happens when bar = 1, probability = 1/r
                                                \label{sec:org6eb6f98}
                                        \end{enumerate}
                                  \item Case 3: P1 did not hear from P2 and vice versa
                                        \label{sec:orgb0c8981}
                                        This case would not cause error, since they will both conclude 0.
                                  \item Case 4: P1 heard from P2 and vice versa
                                        \label{sec:org50ae750}
                                        \begin{itemize}
                                          \item The only violatable condition before concluding 1, is that \texttt{level<bar}.
                                          \item Their \textbf{level} difference is at most one (by lemma).
                                          \item Probability is \texttt{1/r}, when the \textbf{bar} is set to the maximum of the two.
                                        \end{itemize}
                                \end{enumerate}
                          \item Conclusion: error probability is 1/r.
                                \label{sec:org631d363}
                        \end{enumerate}
                  \item Weakened Validity
                        \label{sec:orgecacf0a}
                        \begin{itemize}
                          \item suppose everyone starts with 0, no one can conclude 1 therefore everyone will
                                conclude 0.
                          \item suppose everyone starts with 1.
                                \begin{itemize}
                                  \item suppose no message lost, everyone will reach \textbf{bar} in \texttt{r} (\(r\ge bar\))
                                        rounds. In fact, everyone will have \textbf{level} = \texttt{r}. Everyone will conclude 1.
                                  \item suppose message lost, then can decide on anything.
                                \end{itemize}
                        \end{itemize}
                \end{enumerate}
        \end{enumerate}
  \item Error probability of 1/\#rounds is a lower bound.
        \label{sec:orge6193b0}
        \begin{itemize}
          \item proof can be found in Lynch.
        \end{itemize}
\end{enumerate}
\subsection{Version 3: (Asynchronous) Node crash failures}
\label{sec:orgdf19b89}
