y3s2/cs4231/cs4231.org
*** Setup
- Nodes can crash (indefinitely), but channels are reliable
- Asynchronous: message delay is unbounded
- Impact: can no longer define a round
*** Fischer-Lynch-Paterson (FLP) Impossibility Theorem
Statement: the distributed consensus problem under the asynchronous timing model
is impossible to solve, even with a *single* node crash failure.
- Fundamental reason: the protocol is unable to accurately detect node failure.
** Version 4: (Synchronous) Byzantine Failures
*** Failure Model
Each node can "lie" about its input.
*** Modified goals - everything only applies to non-faulty nodes
*** A simple (unsuccessful) attempt
1. (Byzantine fault) A tells B 1, A tells C 0.
   B tells everyone 1.
   C tells everyone 0.
   | node | received |
   |------+----------|
   | A    | 1, 1, 0  |
   | B    | 1, 1, 0  |
   | C    | 0, 1, 0  |
2. Anyone could be lying. C decides B is lying -> it decides on 0. Similarly, B
   will decide on 1, violating Agreement.
3. Furthermore, if you cross-check, you are not sure if the person you
   cross-check with is reliable.
*** Theorem: Byzantine Consensus Threshold
- Theorem: if number of processes =n=, number of byzantine failures =f=, if
  =n<=3f=, then any protocol cannot reach consensus.
- Proof: omitted.
*** A protocol for # nodes n >= 4f+1
**** Definitions
- We have /phases/.
- Each phase has a /coordinator/ which sends a proposal to all processes.
- If everyone decides, we have an agreement.
- A phase is a /deciding phase/ if the coordinator is nonfaulty.
- Each phase has a 3 rounds: broadcast, coordinator, decision.
**** Protocol
1. Setup: maintain everyone's value initialized to 0, my value = my input.
2. Repeat the following steps (called a phase) for =f+1= times:
   a. Round 1: all-to-all broadcast. Send my input to everyone (including
      myself). Record all msg received (if msg is non-binary or null, set it to
      0). If there is a majority (occurrence > n/2) value, let =proposal= be that
      value, otherwise =proposal= is 0.
   b. Round 2: coordinator. if I am the coordinator (the ith phase has the ith node as
      coord), send proposal to all, otherwise receive a proposal.
   c. Round 3: if there is an overwhelming majority in V (already determined in
      R1), ie > n/2 + f, set my value to that majority value, otherwise set it
      to the proposal.
3. After phases end, conclude with my value.
**** Correctness - invariance for every round
***** Lemma 1: all non-faulty processes retain =y= if all their values are =y=
Since $n \ge 4f+1$, we must have $n-f \ge 3f+1 \ge (4f + 1)/2 + f = n/2 + f$.
This means the non-faulty nodes must be a overwhelming majority. Suppose they
all have the same value at the start of phase =k=, they must retain these values
at end of phase =k= forced by round 3.
***** Lemma 2: if coord is nonfaulty, then all nonfaulty processes have the same value after a round k.
The coordinator can propose two values:
1. Proposes some =x=. =x= occurs MORE THAN =n/2= times on coordinator process.
   Worst case, =f= out of =n/2= are faulty. These MORE THAN =n/2-f= non-faulty
   nodes must broadcast exactly these values to others, thus on any other nodes,
   they cannot have another value =y= having the overwhelming majority (=y= can
   only have LESS THAN =n/2+f= votes) in R3 and can thus only accept the
   proposal.
2. Proposes 0. This means out of all the values coord sees, none exceed =n/2=.
   It means none of these values will reach overwhelming majority MORE THAN
   =n/2+f= since the amount can differ by atmost f.
***** Termination - we let there be f+1 phases. No wait => termination.
***** Validity - by lemma 1, the invariance make them decide its input.
