y3s2/cs4231/cs4231.html
<div id="outline-container-orgbc04526" class="outline-4">
<h4 id="orgbc04526"><span class="section-number-4">5.6.1</span> Setup</h4>
<div class="outline-text-4" id="text-5-6-1">
<ul class="org-ul">
<li>Nodes can crash (indefinitely), but channels are reliable</li>
<li>Asynchronous: message delay is unbounded</li>
<li>Impact: can no longer define a round</li>
</ul>
</div>
</div>
<div id="outline-container-org9becade" class="outline-4">
<h4 id="org9becade"><span class="section-number-4">5.6.2</span> Fischer-Lynch-Paterson (FLP) Impossibility Theorem</h4>
<div class="outline-text-4" id="text-5-6-2">
<p>
Statement: the distributed consensus problem under the asynchronous timing model
is impossible to solve, even with a <b>single</b> node crash failure.
</p>
<ul class="org-ul">
<li>Fundamental reason: the protocol is unable to accurately detect node failure.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org40785d1" class="outline-3">
<h3 id="org40785d1"><span class="section-number-3">5.7</span> Version 4: (Synchronous) Byzantine Failures</h3>
<div class="outline-text-3" id="text-5-7">
</div>
<div id="outline-container-orgebda40e" class="outline-4">
<h4 id="orgebda40e"><span class="section-number-4">5.7.1</span> Failure Model</h4>
<div class="outline-text-4" id="text-5-7-1">
<p>
Each node can &ldquo;lie&rdquo; about its input.
</p>
</div>
</div>
<div id="outline-container-org4c3775c" class="outline-4">
<h4 id="org4c3775c"><span class="section-number-4">5.7.2</span> Modified goals - everything only applies to non-faulty nodes</h4>
</div>
<div id="outline-container-orgea28da3" class="outline-4">
<h4 id="orgea28da3"><span class="section-number-4">5.7.3</span> A simple (unsuccessful) attempt</h4>
<div class="outline-text-4" id="text-5-7-3">
<ol class="org-ol">
<li><p>
(Byzantine fault) A tells B 1, A tells C 0.
B tells everyone 1.
C tells everyone 0.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">node</th>
<th scope="col" class="org-left">received</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">1, 1, 0</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">1, 1, 0</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">0, 1, 0</td>
</tr>
</tbody>
</table></li>
<li>Anyone could be lying. C decides B is lying -&gt; it decides on 0. Similarly, B
will decide on 1, violating Agreement.</li>
<li>Furthermore, if you cross-check, you are not sure if the person you
cross-check with is reliable.</li>
</ol>
</div>
</div>
<div id="outline-container-org8d3a11e" class="outline-4">
<h4 id="org8d3a11e"><span class="section-number-4">5.7.4</span> Theorem: Byzantine Consensus Threshold</h4>
<div class="outline-text-4" id="text-5-7-4">
<ul class="org-ul">
<li>Theorem: if number of processes <code>n</code>, number of byzantine failures <code>f</code>, if
<code>n&lt;=3f</code>, then any protocol cannot reach consensus.</li>
<li>Proof: omitted.</li>
</ul>
</div>
</div>
<div id="outline-container-orgadd4419" class="outline-4">
<h4 id="orgadd4419"><span class="section-number-4">5.7.5</span> A protocol for # nodes n &gt;= 4f+1</h4>
<div class="outline-text-4" id="text-5-7-5">
</div>
<ol class="org-ol">
<li><a id="org86dfc78"></a>Definitions<br />
<div class="outline-text-5" id="text-5-7-5-1">
<ul class="org-ul">
<li>We have <i>phases</i>.</li>
<li>Each phase has a <i>coordinator</i> which sends a proposal to all processes.</li>
<li>If everyone decides, we have an agreement.</li>
<li>A phase is a <i>deciding phase</i> if the coordinator is nonfaulty.</li>
<li>Each phase has a 3 rounds: broadcast, coordinator, decision.</li>
</ul>
</div>
</li>
<li><a id="org81712c0"></a>Protocol<br />
<div class="outline-text-5" id="text-5-7-5-2">
<ol class="org-ol">
<li>Setup: maintain everyone&rsquo;s value initialized to 0, my value = my input.</li>
<li>Repeat the following steps (called a phase) for <code>f+1</code> times:
<ol class="org-ol">
<li>Round 1: all-to-all broadcast. Send my input to everyone (including
myself). Record all msg received (if msg is non-binary or null, set it to
0). If there is a majority (occurrence &gt; n/2) value, let <code>proposal</code> be that
value, otherwise <code>proposal</code> is 0.</li>
<li>Round 2: coordinator. if I am the coordinator (the ith phase has the ith node as
coord), send proposal to all, otherwise receive a proposal.</li>
<li>Round 3: if there is an overwhelming majority in V (already determined in
R1), ie &gt; n/2 + f, set my value to that majority value, otherwise set it
to the proposal.</li>
</ol></li>
<li>After phases end, conclude with my value.</li>
</ol>
</div>
</li>
<li><a id="org95a4fa0"></a>Correctness - invariance for every round<br />
<ol class="org-ol">
<li><a id="org7f0918e"></a>Lemma 1: all non-faulty processes retain <code>y</code> if all their values are <code>y</code><br />
<div class="outline-text-6" id="text-5-7-5-3-1">
<p>
Since \(n \ge 4f+1\), we must have \(n-f \ge 3f+1 \ge (4f + 1)/2 + f = n/2 + f\).
This means the non-faulty nodes must be a overwhelming majority. Suppose they
all have the same value at the start of phase <code>k</code>, they must retain these values
at end of phase <code>k</code> forced by round 3.
</p>
</div>
</li>
<li><a id="org707745a"></a>Lemma 2: if coord is nonfaulty, then all nonfaulty processes have the same value after a round k.<br />
<div class="outline-text-6" id="text-5-7-5-3-2">
<p>
The coordinator can propose two values:
</p>
<ol class="org-ol">
<li>Proposes some <code>x</code>. <code>x</code> occurs MORE THAN <code>n/2</code> times on coordinator process.
Worst case, <code>f</code> out of <code>n/2</code> are faulty. These MORE THAN <code>n/2-f</code> non-faulty
nodes must broadcast exactly these values to others, thus on any other nodes,
they cannot have another value <code>y</code> having the overwhelming majority (<code>y</code> can
only have LESS THAN <code>n/2+f</code> votes) in R3 and can thus only accept the
proposal.</li>
<li>Proposes 0. This means out of all the values coord sees, none exceed <code>n/2</code>.
It means none of these values will reach overwhelming majority MORE THAN
<code>n/2+f</code> since the amount can differ by atmost f.</li>
</ol>
</div>
</li>
<li><a id="org6cfc21c"></a>Termination - we let there be f+1 phases. No wait =&gt; termination.<br /></li>
<li><a id="org8a863ed"></a>Validity - by lemma 1, the invariance make them decide its input.<br /></li>
