y3s2/cs4231/cs4231.tex
\subsubsection{Setup}
\label{sec:org78afd07}
\begin{itemize}
  \item Nodes can crash (indefinitely), but channels are reliable
  \item Asynchronous: message delay is unbounded
  \item Impact: can no longer define a round
\end{itemize}
\subsubsection{Fischer-Lynch-Paterson (FLP) Impossibility Theorem}
\label{sec:org3e9aec6}
Statement: the distributed consensus problem under the asynchronous timing model
is impossible to solve, even with a \textbf{single} node crash failure.
\begin{itemize}
  \item Fundamental reason: the protocol is unable to accurately detect node failure.
\end{itemize}
\subsection{Version 4: (Synchronous) Byzantine Failures}
\label{sec:org7026a71}
\subsubsection{Failure Model}
\label{sec:orgb5ec6a5}
Each node can ``lie'' about its input.
\subsubsection{Modified goals - everything only applies to non-faulty nodes}
\label{sec:org9b180d8}
\subsubsection{A simple (unsuccessful) attempt}
\label{sec:orgd0f876e}
\begin{enumerate}
  \item (Byzantine fault) A tells B 1, A tells C 0.
        B tells everyone 1.
        C tells everyone 0.
        \begin{center}
          \begin{tabular}{ll}
            node & received\\
            \hline
            A & 1, 1, 0\\
            B & 1, 1, 0\\
            C & 0, 1, 0\\
          \end{tabular}
        \end{center}
  \item Anyone could be lying. C decides B is lying -> it decides on 0. Similarly, B
        will decide on 1, violating Agreement.
  \item Furthermore, if you cross-check, you are not sure if the person you
        cross-check with is reliable.
\end{enumerate}
\subsubsection{Theorem: Byzantine Consensus Threshold}
\label{sec:orgdbbb288}
\begin{itemize}
  \item Theorem: if number of processes \texttt{n}, number of byzantine failures \texttt{f}, if
        \texttt{n<=3f}, then any protocol cannot reach consensus.
  \item Proof: omitted.
\end{itemize}
\subsubsection{A protocol for \# nodes n >= 4f+1}
\label{sec:orgaa3c626}
\begin{enumerate}
  \item Definitions
        \label{sec:orgd8bddc9}
        \begin{itemize}
          \item We have \emph{phases}.
          \item Each phase has a \emph{coordinator} which sends a proposal to all processes.
          \item If everyone decides, we have an agreement.
          \item A phase is a \emph{deciding phase} if the coordinator is nonfaulty.
          \item Each phase has a 3 rounds: broadcast, coordinator, decision.
        \end{itemize}
  \item Protocol
        \label{sec:orgb486711}
        \begin{enumerate}
          \item Setup: maintain everyone's value initialized to 0, my value = my input.
          \item Repeat the following steps (called a phase) for \texttt{f+1} times:
                \begin{enumerate}
                  \item Round 1: all-to-all broadcast. Send my input to everyone (including
                        myself). Record all msg received (if msg is non-binary or null, set it to
                        0). If there is a majority (occurrence > n/2) value, let \texttt{proposal} be that
                        value, otherwise \texttt{proposal} is 0.
                  \item Round 2: coordinator. if I am the coordinator (the ith phase has the ith node as
                        coord), send proposal to all, otherwise receive a proposal.
                  \item Round 3: if there is an overwhelming majority in V (already determined in
                        R1), ie > n/2 + f, set my value to that majority value, otherwise set it
                        to the proposal.
                \end{enumerate}
          \item After phases end, conclude with my value.
        \end{enumerate}
  \item Correctness - invariance for every round
        \label{sec:orge902a7a}
        \begin{enumerate}
          \item Lemma 1: all non-faulty processes retain \texttt{y} if all their values are \texttt{y}
                \label{sec:orgc4d10a8}
                Since \(n \ge 4f+1\), we must have \(n-f \ge 3f+1 \ge (4f + 1)/2 + f = n/2 + f\).
                This means the non-faulty nodes must be a overwhelming majority. Suppose they
                all have the same value at the start of phase \texttt{k}, they must retain these values
                at end of phase \texttt{k} forced by round 3.
          \item Lemma 2: if coord is nonfaulty, then all nonfaulty processes have the same value after a round k.
                \label{sec:orgec8b153}
                The coordinator can propose two values:
                \begin{enumerate}
                  \item Proposes some \texttt{x}. \texttt{x} occurs MORE THAN \texttt{n/2} times on coordinator process.
                        Worst case, \texttt{f} out of \texttt{n/2} are faulty. These MORE THAN \texttt{n/2-f} non-faulty
                        nodes must broadcast exactly these values to others, thus on any other nodes,
                        they cannot have another value \texttt{y} having the overwhelming majority (\texttt{y} can
                        only have LESS THAN \texttt{n/2+f} votes) in R3 and can thus only accept the
                        proposal.
                  \item Proposes 0. This means out of all the values coord sees, none exceed \texttt{n/2}.
                        It means none of these values will reach overwhelming majority MORE THAN
                        \texttt{n/2+f} since the amount can differ by atmost f.
                \end{enumerate}
          \item Termination - we let there be f+1 phases. No wait => termination.
                \label{sec:orgf61872d}
          \item Validity - by lemma 1, the invariance make them decide its input.
                \label{sec:org9adb32d}
          \item Agreement
                \label{sec:org3ac6d38}
                \begin{itemize}
