y3s2/cs4231/cs4231.org
***** Agreement
- =f+1= phases means at least one good phase.
- The one good phase triggers lemma 2.
- Lemma 2 triggers lemma 1, agreeing on the value as per lemma 1.
