y3s2/cs4231/cs4231.tex
                  \item \texttt{f+1} phases means at least one good phase.
                  \item The one good phase triggers lemma 2.
                  \item Lemma 2 triggers lemma 1, agreeing on the value as per lemma 1.
                \end{itemize}
        \end{enumerate}
\end{enumerate}
\end{document}
